FocusGroup8/FocusLamp_DEMO2/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# end of Partition Table

#
# WebSocket Manager Configuration
#

#
# Client Configuration
#
CONFIG_WS_MANAGER_CLIENT_URI="ws://192.168.4.2:8765"
# end of Client Configuration
# end of WebSocket Manager Configuration

#
# WiFi Manager Configuration
#
CONFIG_WIFI_MANAGER_SSID="RT3"
CONFIG_WIFI_MANAGER_PASSWORD="10101010"
# end of WiFi Manager Configuration

#
# Component config
#

#
# Hardware Settings
#

#
# Chip revision
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# end of Chip revision
# end of Hardware Settings

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_HOST_WIFI_ENABLED=y
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
# end of Wi-Fi

#
# ESP-Hosted config
#
CONFIG_ESP_HOSTED_ENABLE_ITWT=n
# end of ESP-Hosted config

#
# Wi-Fi Remote
#
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y
# end of Wi-Fi Remote
# end of Component config
